# 给点点的信

### 1. 关于这次讨论
因为我们这样跨洋的讨论毕竟不是为了解决你生活费怎么花,恋爱怎么谈,C++编程中一个概念这些具体的小事,而是想找到如何看待和解决这堆事情的观点和方法 -- 我想这才是你真正想要!

### 2. 从身边的事着手
**身边的事** 就是实实在在我们能感受和理解的事,对我影响最大的事.
我们能感受和理解的事,才是最有说服力,才是思辨最好的材料,高远的论点无论他听起来多好听 ,也经不起一个反例的推敲,不是吗?

* 举例身边的事情: 我工作中的事,小区车委会的问题,综艺节目中嘉宾的经历,小说中的故事,历史事实,中国高铁确实很牛逼 ...  这些事我多少都有能力去分析判断他的真假好坏吧? 
* 举例比较远的事情: 特朗普的对华政策(我不是间谍,他自己估计也还没搞清楚吧?), 中国经济走势(不是财经专业,也无足够数据), 欧盟分裂(关我屁事?),叙利亚问题(同情但爱莫能助)
* 举例更远的事情: 上帝是否存在(玄而又玄,仁者见仁的事情), 宇宙的大小(关我屁事?),时间的实质(对现实没有啥意义啊,如果这个讨论结果能使我回到过去,那他才能算我身边的事)

### 3. 我不完美
智力,体力,财力的限制, 使我无法说出完美的话, 想出完美的理论, 给出大家都满意的结果. 同时,我能认识到自己的不完美,我就觉得自己人格上已经很完美了 :) 
哲学上我认为: 完美就像无穷大一样根本不存在,或者即使存在也要付出极大的代价,完美太难以捕捉了! 所以我放弃追求完美 --- 起码不把他定位为最重要的事情 --- **放下枷锁,我现在轻松多了!**
方法论上: 想一千次不如做一次!   -- 一个茅草屋比一张宏伟蓝图更温暖.

### 4. 理论现在 对你 不重要!
**我建议你:**
   在现阶段, 不要在理论上追求的太多,太深,太贪婪; 
   应该有所感悟后就去实践,在实践中领悟道理. -- 毕竟理论是为实践服务的,本末倒置就愚蠢了! 
   来自实践的感受是最深,最有说服力的; -- 何必舍近求远?
   最后,你会发现,理论也许你讲不清,但行动的过程你思路清晰,结果你也很满意 -- 理论内化到行动中了 -- 你会感觉很幸福, 这就够啦!  除非你要出书传播知识,那时你要严谨地去研究理论~
   这就是我所谓的理论"不重要",  **幸福更重要**. 
   从实践到理论的这个思考方向,对大多数身边问题的研究和解决是十分合理的.

### 5. 你图个啥?
* 我想:
    你试图研究哲学三个终极问题(我从哪里来,到哪里去,我是谁) 的原因是 因为你缺乏目标.
* 我们来讨论一下你目前应该有的目标(可能不完全对,因为我不完美):
    如何解决经济压力
    毕业后我该去做什么
    未来如何幸福地生活
    我该怎么帮助我的家人
    我现在应该做些什么准备

这些是攸关你当前生活的问题,也攸关你未来的问题, 何不从这些问题着手?  应该能找到一步步的目标吧 .

我抽其中一个问题来举例讨论 : "未来如何幸福地生活"
我喜欢从一点切入而后蚕食全局, 就像虫子吃苹果多从烂的地方咬进去,剩下的顺理成章地吃就行了 -- 这个方法百试不爽:)
* 切入点:去youtube 看一档台湾综艺节目:**私房话老实说** --- 很具体很有趣, 收集些男女相处之道的至理名言! 将来用的到.
* 吃苹果:
    * 去实践, 多谈几次恋爱,每次都专一而真心的爱! 晚一点结婚, 结婚是重大问题,没有判断力前不要轻言结婚. -- 那个主持人于美人本身也有不完美的婚姻,你可以百度她 :)
    * 多挣点钱,让自己更独立,有能力掌握自己的幸福
    * 多读些书,让自己精神更丰富,知识可以改变自己!
    * 注意安全, 君子不立危墙之下哦~ 
    * 没了
这么大的问题,也能解决,不是很有成就感吗?

### 最后来一句富有哲理的话
世间万事,即不简单,也不复杂!
